#include <stdio.h>
int main(){
    int a1,b1,c1;
    int a2,b2,c2;
    int a3,b3,c3;
    scanf("Введите через пробел координаты первого вектра: %d%d%d",&a1,&b1,&c1);
    scanf("Введите через пробел координаты второго вектра: %d%d%d",&a2,&b2,&c2);
    scanf("Введите через пробел координаты третьего вектра: %d%d%d",&a3,&b3,&c3);
    // проверка компланарности
    int d = a1*b2*c3 + a3*b1*c2 + a2*b3*c1 - a3*b2*c1 - a1*b3*c2 - a2*b1*c3;
    if (d == 0){
        printf("Векторы компланарны");
    } else {
        printf("Векторы некомпланарны");
    }
}
